ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore_peripherals.h
#define PCGCM020_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM020_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM020_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM020_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM030_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM030_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM030_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM030_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM300_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM300_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM300_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM300_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM310_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM310_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM310_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM310_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

/*CPU Configuration*/
#define CPUCONF_PRESENT 1
#define CPUCONF_COUNT 1

#define CPUCONF_HASTASKERASECACHE 1                  /*!< (unspecified)                                                        */
#define CPUCONF_HASINITSVTOR 1                       /*!< (unspecified)                                                        */
#define CPUCONF_HASINITNSVTOR 1                      /*!< (unspecified)                                                        */
#define CPUCONF_HASCPUSTART 1                        /*!< (unspecified)                                                        */
#define CPUCONF_HASCPUWAIT 1                         /*!< (unspecified)                                                        */

/*Memory configuration*/
#define MEMCONF_PRESENT 1
#define MEMCONF_COUNT 2

#define MEMCONF_RETTRIM 1                            /*!< (unspecified)                                                        */
#define MEMCONF_REPAIR 0                             /*!< (unspecified)                                                        */
#define MEMCONF_REPAIR_INTERNAL_DOC 0                /*!< (unspecified)                                                        */
#define MEMCONF_POWER 1                              /*!< (unspecified)                                                        */
#define MEMCONF_RET2 1                               /*!< (unspecified)                                                        */
#define MEMCONF_RETAIN_PUBLIC_DOC 1                  /*!< (unspecified)                                                        */
#define MEMCONF_RETAIN_INTERNAL_DOC 0                /*!< (unspecified)                                                        */
#define MEMCONF_TRIM_INTERNAL_DOC 0                  /*!< (unspecified)                                                        */

#define MEMCONF310_RETTRIM 1                         /*!< (unspecified)                                                        */
#define MEMCONF310_REPAIR 0                          /*!< (unspecified)                                                        */
#define MEMCONF310_REPAIR_INTERNAL_DOC 0             /*!< (unspecified)                                                        */
#define MEMCONF310_POWER 1                           /*!< (unspecified)                                                        */
#define MEMCONF310_RET2 1                            /*!< (unspecified)                                                        */
#define MEMCONF310_RETAIN_PUBLIC_DOC 1               /*!< (unspecified)                                                        */
#define MEMCONF310_RETAIN_INTERNAL_DOC 0             /*!< (unspecified)                                                        */
#define MEMCONF310_TRIM_INTERNAL_DOC 0               /*!< (unspecified)                                                        */

/*Watchdog Timer*/
#define WDT_PRESENT 1
#define WDT_COUNT 4

#define WDT010_START_ON_RESET 0                      /*!< (unspecified)                                                        */
#define WDT010_CRV_RESETVALUE 4294967295             /*!< (unspecified)                                                        */
#define WDT010_ALLOW_STOP 0                          /*!< (unspecified)                                                        */
#define WDT010_HAS_INTEN 1                           /*!< (unspecified)                                                        */

#define WDT011_START_ON_RESET 0                      /*!< (unspecified)                                                        */
#define WDT011_CRV_RESETVALUE 4294967295             /*!< (unspecified)                                                        */
#define WDT011_ALLOW_STOP 0                          /*!< (unspecified)                                                        */
#define WDT011_HAS_INTEN 1                           /*!< (unspecified)                                                        */

#define WDT131_START_ON_RESET 0                      /*!< (unspecified)                                                        */
#define WDT131_CRV_RESETVALUE 4294967295             /*!< (unspecified)                                                        */
#define WDT131_ALLOW_STOP 0                          /*!< (unspecified)                                                        */
#define WDT131_HAS_INTEN 1                           /*!< (unspecified)                                                        */

#define WDT132_START_ON_RESET 0                      /*!< (unspecified)                                                        */
#define WDT132_CRV_RESETVALUE 4294967295             /*!< (unspecified)                                                        */
#define WDT132_ALLOW_STOP 0                          /*!< (unspecified)                                                        */
#define WDT132_HAS_INTEN 1                           /*!< (unspecified)                                                        */

/*RESETINFO*/
#define RESETINFO_PRESENT 1
#define RESETINFO_COUNT 1

#define RESETINFO_HASRESETREAS 1                     /*!< (unspecified)                                                        */
#define RESETINFO_CROSSDOMAINRESET 0                 /*!< (unspecified)                                                        */

