ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore_peripherals.h
/*I3C*/
#define I3C_PRESENT 1
#define I3C_COUNT 2

/*Quad serial peripheral interface*/
#define QSPI_PRESENT 1
#define QSPI_COUNT 2

#define QSPI120_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define QSPI120_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define QSPI120_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define QSPI120_EASYDMAPATTERNMATCHERINCLUDED 0      /*!< (unspecified)                                                        */
#define QSPI120_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                  */
#define QSPI120_EASYDMASTOPTASKINCLUDED 1            /*!< (unspecified)                                                        */
#define QSPI120_NUM_CLOCK_POWER_PAIR_MIN 0           /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define QSPI120_NUM_CLOCK_POWER_PAIR_MAX 0           /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define QSPI120_NUM_CLOCK_POWER_PAIR_SIZE 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define QSPI120_NOTFULLPCPZERO 1                     /*!< (unspecified)                                                        */
#define QSPI120_PENALTYTASKS 0                       /*!< (unspecified)                                                        */
#define QSPI120_AXI_LITE 1                           /*!< (unspecified)                                                        */
#define QSPI120_FIFO_DEPTH 16                        /*!< Depth of the transmit and receive FIFOs is 16                        */

#define QSPI121_EASYDMALISTINCLUDED 0                /*!< (unspecified)                                                        */
#define QSPI121_EASYDMAMODEINCLUDED 0                /*!< (unspecified)                                                        */
#define QSPI121_EASYDMAFULLLPMODEINCLUDED 0          /*!< (unspecified)                                                        */
#define QSPI121_EASYDMAPATTERNMATCHERINCLUDED 0      /*!< (unspecified)                                                        */
#define QSPI121_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                  */
#define QSPI121_EASYDMASTOPTASKINCLUDED 1            /*!< (unspecified)                                                        */
#define QSPI121_NUM_CLOCK_POWER_PAIR_MIN 0           /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define QSPI121_NUM_CLOCK_POWER_PAIR_MAX 0           /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define QSPI121_NUM_CLOCK_POWER_PAIR_SIZE 1          /*!< Number of clock/power pairs used by PCGC Slave - [0..0]              */
#define QSPI121_NOTFULLPCPZERO 1                     /*!< (unspecified)                                                        */
#define QSPI121_PENALTYTASKS 0                       /*!< (unspecified)                                                        */
#define QSPI121_AXI_LITE 1                           /*!< (unspecified)                                                        */
#define QSPI121_FIFO_DEPTH 16                        /*!< Depth of the transmit and receive FIFOs is 16                        */

/*Controller Area Network*/
#define CAN_PRESENT 1
#define CAN_COUNT 2

/*Pulse width modulation unit*/
#define PWM_PRESENT 1
#define PWM_COUNT 5

#define PWM120_EASYDMA5 1                            /*!< (unspecified)                                                        */
#define PWM120_EASYDMATEMP 0                         /*!< (unspecified)                                                        */
#define PWM120_IDLE_OUT 1                            /*!< (unspecified)                                                        */
#define PWM120_COMPARE_MATCH 1                       /*!< (unspecified)                                                        */
#define PWM120_FEATURES_V2 0                         /*!< (unspecified)                                                        */
#define PWM120_NO_FEATURES_V2 1                      /*!< (unspecified)                                                        */
#define PWM120_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM120_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM120_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PWM120_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PWM120_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PWM120_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define PWM130_EASYDMA5 1                            /*!< (unspecified)                                                        */
#define PWM130_EASYDMATEMP 0                         /*!< (unspecified)                                                        */
#define PWM130_IDLE_OUT 1                            /*!< (unspecified)                                                        */
#define PWM130_COMPARE_MATCH 1                       /*!< (unspecified)                                                        */
#define PWM130_FEATURES_V2 0                         /*!< (unspecified)                                                        */
#define PWM130_NO_FEATURES_V2 1                      /*!< (unspecified)                                                        */
#define PWM130_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM130_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM130_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PWM130_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PWM130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PWM130_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define PWM131_EASYDMA5 1                            /*!< (unspecified)                                                        */
#define PWM131_EASYDMATEMP 0                         /*!< (unspecified)                                                        */
#define PWM131_IDLE_OUT 1                            /*!< (unspecified)                                                        */
#define PWM131_COMPARE_MATCH 1                       /*!< (unspecified)                                                        */
#define PWM131_FEATURES_V2 0                         /*!< (unspecified)                                                        */
#define PWM131_NO_FEATURES_V2 1                      /*!< (unspecified)                                                        */
#define PWM131_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM131_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM131_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PWM131_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PWM131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PWM131_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define PWM132_EASYDMA5 1                            /*!< (unspecified)                                                        */
#define PWM132_EASYDMATEMP 0                         /*!< (unspecified)                                                        */
#define PWM132_IDLE_OUT 1                            /*!< (unspecified)                                                        */
#define PWM132_COMPARE_MATCH 1                       /*!< (unspecified)                                                        */
#define PWM132_FEATURES_V2 0                         /*!< (unspecified)                                                        */
#define PWM132_NO_FEATURES_V2 1                      /*!< (unspecified)                                                        */
#define PWM132_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM132_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM132_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PWM132_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PWM132_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PWM132_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define PWM133_EASYDMA5 1                            /*!< (unspecified)                                                        */
#define PWM133_EASYDMATEMP 0                         /*!< (unspecified)                                                        */
#define PWM133_IDLE_OUT 1                            /*!< (unspecified)                                                        */
#define PWM133_COMPARE_MATCH 1                       /*!< (unspecified)                                                        */
#define PWM133_FEATURES_V2 0                         /*!< (unspecified)                                                        */
#define PWM133_NO_FEATURES_V2 1                      /*!< (unspecified)                                                        */
#define PWM133_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM133_EASYDMAMODEINCLUDED 0                 /*!< (unspecified)                                                        */
#define PWM133_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define PWM133_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define PWM133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define PWM133_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

