ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore_peripherals.h
#define P0_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P0_CTRLSEL_MAP2 0                            /*!< (unspecified)                                                        */
#define P0_CTRLSEL_MAP3 1                            /*!< (unspecified)                                                        */
#define P0_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P0_PIN_NUM_MAX 11                            /*!< (unspecified)                                                        */
#define P0_PIN_NUM_SIZE 12                           /*!< (unspecified)                                                        */
#define P0_FEATURE_PINS_PRESENT 0x00000FFFUL         /*!< (unspecified)                                                        */
#define P0_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P0_RETAIN 1                                  /*!< (unspecified)                                                        */
#define P0_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P0_PWRCTRL_SEPARATE_REG 1                    /*!< (unspecified)                                                        */
#define P0_VSS_FLOAT_DFT 0                           /*!< (unspecified)                                                        */
#define P0_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P0_WIFI_CORE_PRESENT 1                       /*!< (unspecified)                                                        */
#define P0_RETAIN_PER_PIN 1                          /*!< (unspecified)                                                        */
#define P0_CLOCKPIN 1                                /*!< (unspecified)                                                        */
#define P0_BIASCTRL 0                                /*!< (unspecified)                                                        */

#define P1_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P1_CTRLSEL_MAP2 0                            /*!< (unspecified)                                                        */
#define P1_CTRLSEL_MAP3 1                            /*!< (unspecified)                                                        */
#define P1_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P1_PIN_NUM_MAX 11                            /*!< (unspecified)                                                        */
#define P1_PIN_NUM_SIZE 12                           /*!< (unspecified)                                                        */
#define P1_FEATURE_PINS_PRESENT 0x00000FFFUL         /*!< (unspecified)                                                        */
#define P1_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P1_RETAIN 1                                  /*!< (unspecified)                                                        */
#define P1_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P1_PWRCTRL_SEPARATE_REG 1                    /*!< (unspecified)                                                        */
#define P1_VSS_FLOAT_DFT 0                           /*!< (unspecified)                                                        */
#define P1_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P1_WIFI_CORE_PRESENT 1                       /*!< (unspecified)                                                        */
#define P1_RETAIN_PER_PIN 1                          /*!< (unspecified)                                                        */
#define P1_CLOCKPIN 1                                /*!< (unspecified)                                                        */
#define P1_BIASCTRL 0                                /*!< (unspecified)                                                        */

#define P2_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P2_CTRLSEL_MAP2 0                            /*!< (unspecified)                                                        */
#define P2_CTRLSEL_MAP3 1                            /*!< (unspecified)                                                        */
#define P2_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P2_PIN_NUM_MAX 17                            /*!< (unspecified)                                                        */
#define P2_PIN_NUM_SIZE 18                           /*!< (unspecified)                                                        */
#define P2_FEATURE_PINS_PRESENT 0x0003FFFFUL         /*!< (unspecified)                                                        */
#define P2_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P2_RETAIN 1                                  /*!< (unspecified)                                                        */
#define P2_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P2_PWRCTRL_SEPARATE_REG 1                    /*!< (unspecified)                                                        */
#define P2_VSS_FLOAT_DFT 0                           /*!< (unspecified)                                                        */
#define P2_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P2_WIFI_CORE_PRESENT 1                       /*!< (unspecified)                                                        */
#define P2_RETAIN_PER_PIN 1                          /*!< (unspecified)                                                        */
#define P2_CLOCKPIN 1                                /*!< (unspecified)                                                        */
#define P2_BIASCTRL 0                                /*!< (unspecified)                                                        */

#define P3_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P3_CTRLSEL_MAP2 0                            /*!< (unspecified)                                                        */
#define P3_CTRLSEL_MAP3 1                            /*!< (unspecified)                                                        */
#define P3_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P3_PIN_NUM_MAX 17                            /*!< (unspecified)                                                        */
#define P3_PIN_NUM_SIZE 18                           /*!< (unspecified)                                                        */
#define P3_FEATURE_PINS_PRESENT 0x0003FFFFUL         /*!< (unspecified)                                                        */
#define P3_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P3_RETAIN 1                                  /*!< (unspecified)                                                        */
#define P3_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P3_PWRCTRL_SEPARATE_REG 1                    /*!< (unspecified)                                                        */
#define P3_VSS_FLOAT_DFT 0                           /*!< (unspecified)                                                        */
#define P3_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P3_WIFI_CORE_PRESENT 1                       /*!< (unspecified)                                                        */
#define P3_RETAIN_PER_PIN 1                          /*!< (unspecified)                                                        */
#define P3_CLOCKPIN 1                                /*!< (unspecified)                                                        */
#define P3_BIASCTRL 0                                /*!< (unspecified)                                                        */

#define P5_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P5_CTRLSEL_MAP2 0                            /*!< (unspecified)                                                        */
#define P5_CTRLSEL_MAP3 1                            /*!< (unspecified)                                                        */
#define P5_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P5_PIN_NUM_MAX 13                            /*!< (unspecified)                                                        */
#define P5_PIN_NUM_SIZE 14                           /*!< (unspecified)                                                        */
#define P5_FEATURE_PINS_PRESENT 0x00003FFFUL         /*!< (unspecified)                                                        */
#define P5_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P5_RETAIN 1                                  /*!< (unspecified)                                                        */
#define P5_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P5_PWRCTRL_SEPARATE_REG 1                    /*!< (unspecified)                                                        */
#define P5_VSS_FLOAT_DFT 0                           /*!< (unspecified)                                                        */
#define P5_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P5_WIFI_CORE_PRESENT 1                       /*!< (unspecified)                                                        */
#define P5_RETAIN_PER_PIN 1                          /*!< (unspecified)                                                        */
#define P5_CLOCKPIN 1                                /*!< (unspecified)                                                        */
#define P5_BIASCTRL 1                                /*!< (unspecified)                                                        */

